Documents/гф_ВводНачальныхОстатковКМ.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.14">
	<Document>
		<Properties>
			<Name>гф_ВводНачальныхОстатковКМ</Name>
			<ObjectBelonging>Adopted</ObjectBelonging>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Склад</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ШтрихкодыУпаковокТоваров</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ЗначениеШтрихкода</Name>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>200</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>GTIN</Name>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>200</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомерГТД</Name>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>30</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Documents/гф_ВводНачальныхОстатковКМ/Forms/гф_ФормаДокумента/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиент.НачатьОбновлениеКоманд(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКомандыКонецПроцедуры
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиент.ПослеЗаписи(ЭтотОбъект, Объект, ПараметрыЗаписи);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

// СтандартныеПодсистемы.ПодключаемыеКоманды

&НаКлиенте
Процедура Подключаемый_ВыполнитьКоманду(Команда)
	ПодключаемыеКомандыКлиент.НачатьВыполнениеКоманды(ЭтотОбъект, Команда, Объект);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ПродолжитьВыполнениеКомандыНаСервере(ПараметрыВыполнения, ДополнительныеПараметры) Экспорт
	ВыполнитьКомандуНаСервере(ПараметрыВыполнения);
КонецПроцедуры

&НаСервере
Процедура ВыполнитьКомандуНаСервере(ПараметрыВыполнения)
	ПодключаемыеКоманды.ВыполнитьКоманду(ЭтотОбъект, ПараметрыВыполнения, Объект);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОбновитьКоманды()
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
КонецПроцедуры

// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

&НаКлиенте
Процедура ЗагрузитьКМизФайла(Команда)
	ПараметрыЗагрузки = ЗагрузкаДанныхИзФайлаКлиент.ПараметрыЗагрузкиДанных();
	ПараметрыЗагрузки.ПолноеИмяТабличнойЧасти = "гф_ВводНачальныхОстатковКМ.ШтрихкодыУпаковокТоваров";
	ПараметрыЗагрузки.Заголовок = НСтр("ru = 'Загрузка кодов маркировки из файла'");
	ДополнительныеПараметры = Новый Структура();
	ПараметрыЗагрузки.ДополнительныеПараметры = ДополнительныеПараметры;
	Оповещение = Новый ОписаниеОповещения("ЗагрузитьКмИзФайлаЗавершение", ЭтотОбъект);
	ЗагрузкаДанныхИзФайлаКлиент.ПоказатьФормуЗагрузки(ПараметрыЗагрузки, Оповещение);
КонецПроцедуры

&НаКлиенте
Процедура ЗагрузитьКмИзФайлаЗавершение(АдресЗагруженныхДанных, ДополнительныеПараметры) Экспорт
	Если АдресЗагруженныхДанных = Неопределено Тогда 
		Возврат;
	КонецЕсли;
	ЗагрузитьКмИзФайлаНаСервере(АдресЗагруженныхДанных);
КонецПроцедуры

&НаСервере
Процедура ЗагрузитьКмИзФайлаНаСервере(АдресЗагруженныхДанных)
	ЗагруженныеДанные = ПолучитьИзВременногоХранилища(АдресЗагруженныхДанных);
	КмДобавлены = Ложь;
	Для каждого СтрокаТаблицы Из ЗагруженныеДанные Цикл 
		Если Не ЗначениеЗаполнено(СтрокаТаблицы.ЗначениеШтрихкода) Тогда 
			Продолжить;
		КонецЕсли;
		НоваяСтрокаКм = Объект.ШтрихкодыУпаковокТоваров.Добавить();
		НоваяСтрокаКм.ЗначениеШтрихкода = СокрЛП(СтрокаТаблицы.ЗначениеШтрихкода);
		НоваяСтрокаКм.GTIN = СокрЛП(СтрокаТаблицы.GTIN);
		НоваяСтрокаКм.НомерГТД = СокрЛП(СтрокаТаблицы.НомерГТД);
		НоваяСтрокаКм.СтранаПроисхождения = СтрокаТаблицы.СтранаПроисхождения;
		НоваяСтрокаКм.спрНомерГТД = СтрокаТаблицы.спрНомерГТД;
		КмДобавлены = Истина;
	КонецЦикла;
	Если КмДобавлены Тогда
		Модифицированность = Истина;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПодобратьGTIN(Команда)
	ПодобратьGTINНаСервере();
КонецПроцедуры

&НаСервере
Процедура ПодобратьGTINНаСервере()
	
	тч = Объект.ШтрихкодыУпаковокТоваров.Выгрузить();
	Запрос = Новый Запрос;
	Запрос.Текст = "
	|ВЫБРАТЬ
	|	т.ЗначениеШтрихкода КАК ЗначениеШтрихкода,
	|	ПОДСТРОКА(т.ЗначениеШтрихкода, 5, 14) КАК GTIN_14,
	|	ПОДСТРОКА(т.ЗначениеШтрихкода, 5, 13) КАК GTIN_13
	|ПОМЕСТИТЬ втШтрихкоды
	|ИЗ
	|	&тч КАК т
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	втШтрихкоды.ЗначениеШтрихкода КАК ЗначениеШтрихкода,
	|	ВЫБОР
	|		КОГДА ШтрихкодыНоменклатуры_14.Штрихкод ЕСТЬ НЕ NULL 
	|			ТОГДА ШтрихкодыНоменклатуры_14.Штрихкод
	|		КОГДА ШтрихкодыНоменклатуры_13.Штрихкод ЕСТЬ НЕ NULL 
	|			ТОГДА ШтрихкодыНоменклатуры_13.Штрихкод
	|		ИНАЧЕ """"
	|	КОНЕЦ КАК GTIN
	|ИЗ
	|	втШтрихкоды КАК втШтрихкоды
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ШтрихкодыНоменклатуры КАК ШтрихкодыНоменклатуры_14
	|		ПО втШтрихкоды.GTIN_14 = ШтрихкодыНоменклатуры_14.Штрихкод
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ШтрихкодыНоменклатуры КАК ШтрихкодыНоменклатуры_13
	|		ПО втШтрихкоды.GTIN_13 = ШтрихкодыНоменклатуры_13.Штрихкод";
	Запрос.УстановитьПараметр("тч", тч);
	Результат = Запрос.Выполнить();
	Выборка = Результат.Выбрать();
	Для каждого стрТч Из тч Цикл
		Выборка.Сбросить();
		СтрПоиска = Новый Структура("ЗначениеШтрихкода", стрТч["ЗначениеШтрихкода"]);
		Если Выборка.НайтиСледующий(СтрПоиска) Тогда
			стрТч["GTIN"] = Выборка["GTIN"];
		КонецЕсли;
	КонецЦикла;
	Объект.ШтрихкодыУпаковокТоваров.Загрузить(тч);
	
КонецПроцедуры

#КонецОбласти
